-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th7 27, 2022 lúc 09:27 AM
-- Phiên bản máy phục vụ: 10.4.16-MariaDB
-- Phiên bản PHP: 7.4.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `chan_nuoi_thong_minh`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `account`
--

CREATE TABLE `account` (
  `id` int(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Đang đổ dữ liệu cho bảng `account`
--

INSERT INTO `account` (`id`, `username`, `password`) VALUES
(1, 'admin', 'admin');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `dht11`
--

CREATE TABLE `dht11` (
  `id` int(255) NOT NULL,
  `tem` float(30,2) NOT NULL,
  `hum` float(30,2) NOT NULL,
  `time` timestamp(6) NOT NULL DEFAULT current_timestamp(6)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Đang đổ dữ liệu cho bảng `dht11`
--

INSERT INTO `dht11` (`id`, `tem`, `hum`, `time`) VALUES
(134, 29.90, 68.00, '2022-07-13 09:09:35.163372'),
(135, 29.80, 68.00, '2022-07-13 09:09:41.143205'),
(136, 29.80, 68.00, '2022-07-13 09:09:47.143841'),
(137, 29.80, 67.00, '2022-07-13 09:09:53.135811'),
(138, 29.80, 67.00, '2022-07-13 09:09:59.146835'),
(139, 29.80, 67.00, '2022-07-13 09:10:05.140820'),
(140, 29.80, 67.00, '2022-07-13 09:10:11.143989'),
(141, 29.80, 67.00, '2022-07-13 09:10:17.147524'),
(142, 29.80, 67.00, '2022-07-13 09:10:23.142957'),
(143, 29.80, 67.00, '2022-07-13 09:10:29.141821'),
(144, 29.80, 67.00, '2022-07-13 09:10:35.138060'),
(145, 29.80, 67.00, '2022-07-13 09:10:41.141678'),
(146, 31.80, 75.00, '2022-07-13 09:10:47.140125'),
(147, 31.30, 75.00, '2022-07-13 09:10:53.144610'),
(148, 31.30, 75.00, '2022-07-13 09:10:59.146922'),
(149, 31.30, 76.00, '2022-07-13 09:11:05.143359'),
(150, 31.30, 75.00, '2022-07-13 09:11:11.148094'),
(151, 31.30, 75.00, '2022-07-13 09:11:17.159697'),
(152, 32.80, 68.00, '2022-07-27 04:40:11.733987'),
(153, 32.80, 68.00, '2022-07-27 04:40:17.709191'),
(154, 32.80, 68.00, '2022-07-27 04:40:23.888434'),
(155, 32.80, 68.00, '2022-07-27 04:40:29.722742'),
(156, 32.80, 68.00, '2022-07-27 04:40:35.885289'),
(157, 32.80, 68.00, '2022-07-27 04:40:41.903973'),
(158, 32.80, 68.00, '2022-07-27 04:40:47.960747'),
(159, 32.80, 68.00, '2022-07-27 04:40:53.887359'),
(160, 32.80, 68.00, '2022-07-27 04:40:59.897640'),
(161, 32.80, 68.00, '2022-07-27 04:41:05.904653'),
(162, 32.80, 68.00, '2022-07-27 04:41:11.874431'),
(163, 32.80, 68.00, '2022-07-27 04:41:17.710412'),
(164, 32.80, 68.00, '2022-07-27 04:41:23.930442'),
(165, 32.80, 68.00, '2022-07-27 04:41:29.859779'),
(166, 32.90, 67.00, '2022-07-27 04:47:24.651635'),
(167, 33.30, 66.00, '2022-07-27 04:47:30.641345'),
(168, 33.30, 66.00, '2022-07-27 04:47:36.706397'),
(169, 33.30, 66.00, '2022-07-27 04:47:46.105026'),
(170, 33.30, 66.00, '2022-07-27 04:47:52.014986'),
(171, 33.30, 66.00, '2022-07-27 04:47:58.034972'),
(172, 33.30, 66.00, '2022-07-27 04:48:04.061821'),
(173, 33.30, 66.00, '2022-07-27 04:48:10.026713'),
(174, 33.30, 66.00, '2022-07-27 04:48:16.013519'),
(175, 33.30, 66.00, '2022-07-27 04:48:21.913393'),
(176, 33.30, 66.00, '2022-07-27 04:48:28.184816'),
(177, 33.30, 66.00, '2022-07-27 04:48:39.921398'),
(178, 33.30, 66.00, '2022-07-27 04:48:46.098868'),
(179, 33.30, 66.00, '2022-07-27 04:48:52.069119'),
(180, 33.30, 66.00, '2022-07-27 04:48:58.069011'),
(181, 33.30, 66.00, '2022-07-27 04:49:04.112162'),
(182, 33.30, 66.00, '2022-07-27 04:49:10.056787'),
(183, 33.30, 66.00, '2022-07-27 04:49:16.037072'),
(184, 33.30, 66.00, '2022-07-27 04:49:22.065719'),
(185, 33.30, 66.00, '2022-07-27 04:49:28.018883'),
(186, 34.20, 66.00, '2022-07-27 04:53:32.397188'),
(187, 34.20, 66.00, '2022-07-27 04:53:38.419915'),
(188, 34.20, 66.00, '2022-07-27 04:53:44.405337'),
(189, 34.20, 66.00, '2022-07-27 04:53:50.373995'),
(190, 33.80, 66.00, '2022-07-27 05:01:17.728670'),
(191, 33.80, 66.00, '2022-07-27 05:01:23.882041'),
(192, 33.80, 66.00, '2022-07-27 05:01:29.889565'),
(193, 33.80, 66.00, '2022-07-27 05:01:35.754313'),
(194, 33.80, 66.00, '2022-07-27 05:01:42.033804'),
(195, 33.80, 66.00, '2022-07-27 05:01:47.733852'),
(196, 33.80, 66.00, '2022-07-27 05:01:53.863253'),
(197, 33.80, 66.00, '2022-07-27 05:01:59.911866'),
(198, 34.10, 66.00, '2022-07-27 05:02:05.882299'),
(199, 34.20, 66.00, '2022-07-27 05:02:11.725011'),
(200, 34.20, 66.00, '2022-07-27 05:02:17.886324'),
(201, 34.20, 66.00, '2022-07-27 05:02:23.824339'),
(202, 34.20, 66.00, '2022-07-27 05:02:29.747074');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `switch`
--

CREATE TABLE `switch` (
  `id` int(255) NOT NULL,
  `status` int(255) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Đang đổ dữ liệu cho bảng `switch`
--

INSERT INTO `switch` (`id`, `status`, `name`) VALUES
(1, 0, 'quat'),
(2, 0, 'dieuhoa'),
(3, 1, 'maysuoi'),
(4, 1, 'den');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `thietlap`
--

CREATE TABLE `thietlap` (
  `id` int(11) NOT NULL,
  `tem` float(30,2) NOT NULL,
  `hum` float(30,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Đang đổ dữ liệu cho bảng `thietlap`
--

INSERT INTO `thietlap` (`id`, `tem`, `hum`) VALUES
(1, 0.00, 0.00);

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `account`
--
ALTER TABLE `account`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `dht11`
--
ALTER TABLE `dht11`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `switch`
--
ALTER TABLE `switch`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `thietlap`
--
ALTER TABLE `thietlap`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `account`
--
ALTER TABLE `account`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT cho bảng `dht11`
--
ALTER TABLE `dht11`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=203;

--
-- AUTO_INCREMENT cho bảng `switch`
--
ALTER TABLE `switch`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT cho bảng `thietlap`
--
ALTER TABLE `thietlap`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
